node {
  name: "Const"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_STRING
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_STRING
        tensor_shape {
          dim {
            size: 263
          }
        }
        string_val: "1"
        string_val: "2"
        string_val: "3"
        string_val: "4"
        string_val: "5"
        string_val: "6"
        string_val: "7"
        string_val: "8"
        string_val: "9"
        string_val: "10"
        string_val: "11"
        string_val: "12"
        string_val: "13"
        string_val: "14"
        string_val: "15"
        string_val: "16"
        string_val: "17"
        string_val: "18"
        string_val: "19"
        string_val: "20"
        string_val: "21"
        string_val: "22"
        string_val: "23"
        string_val: "24"
        string_val: "25"
        string_val: "26"
        string_val: "27"
        string_val: "28"
        string_val: "29"
        string_val: "30"
        string_val: "31"
        string_val: "32"
        string_val: "33"
        string_val: "34"
        string_val: "35"
        string_val: "36"
        string_val: "37"
        string_val: "38"
        string_val: "39"
        string_val: "40"
        string_val: "41"
        string_val: "42"
        string_val: "43"
        string_val: "44"
        string_val: "45"
        string_val: "46"
        string_val: "47"
        string_val: "48"
        string_val: "49"
        string_val: "50"
        string_val: "51"
        string_val: "52"
        string_val: "53"
        string_val: "54"
        string_val: "55"
        string_val: "56"
        string_val: "57"
        string_val: "58"
        string_val: "59"
        string_val: "60"
        string_val: "61"
        string_val: "62"
        string_val: "63"
        string_val: "64"
        string_val: "65"
        string_val: "71"
        string_val: "72"
        string_val: "73"
        string_val: "76"
        string_val: "77"
        string_val: "78"
        string_val: "79"
        string_val: "80"
        string_val: "81"
        string_val: "82"
        string_val: "83"
        string_val: "84"
        string_val: "85"
        string_val: "86"
        string_val: "87"
        string_val: "88"
        string_val: "89"
        string_val: "90"
        string_val: "91"
        string_val: "92"
        string_val: "93"
        string_val: "94"
        string_val: "95"
        string_val: "96"
        string_val: "97"
        string_val: "98"
        string_val: "99"
        string_val: "100"
        string_val: "101"
        string_val: "102"
        string_val: "103"
        string_val: "104"
        string_val: "105"
        string_val: "106"
        string_val: "107"
        string_val: "108"
        string_val: "109"
        string_val: "110"
        string_val: "111"
        string_val: "112"
        string_val: "113"
        string_val: "114"
        string_val: "115"
        string_val: "116"
        string_val: "117"
        string_val: "118"
        string_val: "119"
        string_val: "120"
        string_val: "121"
        string_val: "122"
        string_val: "123"
        string_val: "124"
        string_val: "125"
        string_val: "126"
        string_val: "127"
        string_val: "128"
        string_val: "129"
        string_val: "130"
        string_val: "131"
        string_val: "132"
        string_val: "133"
        string_val: "134"
        string_val: "135"
        string_val: "136"
        string_val: "137"
        string_val: "138"
        string_val: "139"
        string_val: "140"
        string_val: "141"
        string_val: "142"
        string_val: "143"
        string_val: "144"
        string_val: "146"
        string_val: "147"
        string_val: "148"
        string_val: "149"
        string_val: "150"
        string_val: "151"
        string_val: "152"
        string_val: "153"
        string_val: "154"
        string_val: "155"
        string_val: "156"
        string_val: "157"
        string_val: "158"
        string_val: "159"
        string_val: "160"
        string_val: "161"
        string_val: "162"
        string_val: "163"
        string_val: "164"
        string_val: "165"
        string_val: "166"
        string_val: "167"
        string_val: "168"
        string_val: "169"
        string_val: "170"
        string_val: "171"
        string_val: "172"
        string_val: "173"
        string_val: "174"
        string_val: "175"
        string_val: "176"
        string_val: "177"
        string_val: "178"
        string_val: "179"
        string_val: "180"
        string_val: "181"
        string_val: "182"
        string_val: "183"
        string_val: "184"
        string_val: "185"
        string_val: "186"
        string_val: "187"
        string_val: "188"
        string_val: "189"
        string_val: "190"
        string_val: "191"
        string_val: "192"
        string_val: "193"
        string_val: "194"
        string_val: "195"
        string_val: "196"
        string_val: "197"
        string_val: "198"
        string_val: "199"
        string_val: "200"
        string_val: "201"
        string_val: "202"
        string_val: "203"
        string_val: "204"
        string_val: "205"
        string_val: "206"
        string_val: "207"
        string_val: "208"
        string_val: "209"
        string_val: "210"
        string_val: "211"
        string_val: "212"
        string_val: "213"
        string_val: "214"
        string_val: "215"
        string_val: "216"
        string_val: "217"
        string_val: "218"
        string_val: "219"
        string_val: "237"
        string_val: "259"
        string_val: "296"
        string_val: "297"
        string_val: "298"
        string_val: "299"
        string_val: "300"
        string_val: "301"
        string_val: "302"
        string_val: "311"
        string_val: "312"
        string_val: "313"
        string_val: "314"
        string_val: "315"
        string_val: "316"
        string_val: "317"
        string_val: "323"
        string_val: "324"
        string_val: "329"
        string_val: "330"
        string_val: "331"
        string_val: "332"
        string_val: "333"
        string_val: "334"
        string_val: "335"
        string_val: "336"
        string_val: "337"
        string_val: "338"
        string_val: "339"
        string_val: "342"
        string_val: "343"
        string_val: "345"
        string_val: "346"
        string_val: "347"
        string_val: "348"
        string_val: "349"
        string_val: "350"
        string_val: "351"
        string_val: "352"
        string_val: "353"
        string_val: "354"
        string_val: "355"
        string_val: "356"
        string_val: "357"
        string_val: "358"
        string_val: "359"
        string_val: "360"
        string_val: "361"
        string_val: "362"
        string_val: "363"
        string_val: "364"
        string_val: "370"
      }
    }
  }
}
node {
  name: "keys_var"
  op: "VariableV2"
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_STRING
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 263
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "keys_var/Assign"
  op: "Assign"
  input: "keys_var"
  input: "Const"
  attr {
    key: "T"
    value {
      type: DT_STRING
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@keys_var"
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "keys_var/read"
  op: "Identity"
  input: "keys_var"
  attr {
    key: "T"
    value {
      type: DT_STRING
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@keys_var"
      }
    }
  }
}
node {
  name: "Const_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_STRING
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_STRING
        tensor_shape {
          dim {
            size: 263
          }
        }
        string_val: "Internal system error"
        string_val: "Internal system error. The rack does not match the selected turbine type, e.g. the rack resembles a nacelle rack, but the program is configured for a PS-600 kW WEG"
        string_val: "An expected Cotas module is missing in the Ground rack, or is defect."
        string_val: "An expected Cotas module is missing in the top rack, or is defect."
        string_val: "Internal system error"
        string_val: "Internal system error"
        string_val: "CT3503 can\'t start communication with CT3218. This error is often seen if the software in CT3218 is too old. If CT3118 is a CT3218.01, then CT3503 can\'t update the software in CT3218. If it does not help to update to CT3218.02, then the error may be in the CT3203, or in the rack itself."
        string_val: "CT3503 can\'t start communication with CT3220. This error is often seen if the CT3220 is defect, or is configured with the wrong type of piggybacks. E.g. FFFF instead of BF."
        string_val: "Internal system error"
        string_val: "CT3503 can\'t start communication with CT3232. This error is often caused by a defect, or missing module."
        string_val: "Internal system error"
        string_val: "Internal system error"
        string_val: "Internal system error"
        string_val: "Internal system error"
        string_val: "Internal system error"
        string_val: "Internal system error"
        string_val: "Internal system error"
        string_val: "Internal system error"
        string_val: "Internal system error"
        string_val: "Internal system error"
        string_val: "Internal system error"
        string_val: "Internal system error"
        string_val: "Internal system error"
        string_val: "Internal system error"
        string_val: "If it\'s important to save the counters, the CT3503.Can be started with button 2 and select initial Event timer not initialized This is doing a copy of parameters from Flash EPROM to RAM, without reset of counters. If this does not help, start CT3503 with button 1 and 2 to clear counters, and parameters. This message is also seen if the software has been upgraded without button 1 and 2 restart."
        string_val: "Internal system error"
        string_val: "Internal system error"
        string_val: "Internal system error"
        string_val: "Internal system error"
        string_val: "Internal system error"
        string_val: "Internal system error"
        string_val: "Internal system error"
        string_val: "One of the processors (Top, Ground, Grid etc.) has received more data than it can process."
        string_val: "Internal system error"
        string_val: "Internal system error"
        string_val: "The ground processor has lost contact with the top processor, after the communication to the top has been established. The ArcNet hardware may be unstable, or the top processor has stopped responding due to an error in the top processor. If this error is seen every time the turbine does a specific thing, e.g. goes to PAUSE or connects the generator, the changed parameters should be checked. \r\nThe reason may also be found in the hardware, specially CT3514 in top and ground, and the fiber, but the reason can also be in the rack, power supply, or the CT3251. Check switch settings in CT3514."
        string_val: "The ground processor has lost contact with the grid processor, after the communication to the top has been established. The ArcNet hardware may be unstable, or the grid processor has stopped responding due to an error in the grid processor. \r\nThe grid processor can stop if there is an error in the parameters for the grid processor. The reason can also be in hardware, specially CT3251, and CT3514, but the reason can also be in the rack itself, or the power supply. Check switch settings in CT3514."
        string_val: "nan"
        string_val: "Internal system error"
        string_val: "nan"
        string_val: "Internal system error"
        string_val: "Internal system error"
        string_val: "Internal system error"
        string_val: "The software in the Ground and Top controller doesn\'t match. This indicates that software has not been uploaded to all computers during upload."
        string_val: "The software in the Ground and Grid processor doesn\'t match. This indicates that software has not been uploaded to all computers during upload."
        string_val: "The version number in a Cotas module is too old."
        string_val: "CT3503 receives data in a wrong format from the CT3218. This error is often seen if the software in CT3218 is too old. If CT3218 is a version 01, then CT3503 can\'t update the software in CT3218. If it does not help to update to version 02 or newer, then the error may be in the CT3503, or in the rack itself."
        string_val: "The processors Losses data when communicating,and is retransmitting data too often. This error is an indication of an electrical or optical problem in the ArcNet. The fault is in the CT3514/CT3513, the rack, CT3251."
        string_val: "The ArcNet has been reconfigured (restarted) 10 times this day. During a reconfiguration there is a communication Black-out lasting up to 1 sec. This error is an indication of an electrical or optical problem in the ArcNet. The fault is in the CT3514, the rack, CT3251."
        string_val: "Internal system error"
        string_val: "Internal system error"
        string_val: "The Power Controller CT3251 is not receiving stable Zero Cross interrupts, and the controller is not able to measure Voltage, Current, frequency and power correct. CT3251 is receiving the interrupts from a separate transformer in CT206. If the message has a \'0\' in it\'s text, the interrupts has been missing for 2 grid periods. This error can occur if the voltage suddenly drops, or due to fluctuations from faults somewhere in the grid. If the message has a \'1\' in its text, the interrupts is too frequent. This fault is also seen if the grid has high frequency noise, or the PFC discharge chokes is defect. The fault can also be in the CT206, the CT3251, or the cable connection between them."
        string_val: "Internal system error"
        string_val: "Internal system error"
        string_val: "Internal system error"
        string_val: "Internal system error"
        string_val: "Internal system error"
        string_val: "This error can occur if a parameter for a filter is 0 seconds. Check changed parameters"
        string_val: "nan"
        string_val: "Internal system error"
        string_val: "Internal system error"
        string_val: "Internal system error"
        string_val: "Internal system error"
        string_val: "Internal system error"
        string_val: "Internal system error. The microprocessor has encountered an illegal instruction (Opcode) in the program."
        string_val: "nan"
        string_val: "nan"
        string_val: "nan"
        string_val: "nan"
        string_val: "nan"
        string_val: "nan"
        string_val: "nan"
        string_val: "The supervision starts when the generator rpm is over 750 o/oo (P4.80) of nominal generator RPM. If S412 drops out for more than 5s (P4.79) the error is reported. This text replaces \"Flow filter error\" on turbines with mechanical driven oil pump. Check the pressure, and adjust pressostat if misadjusted"
        string_val: "nan"
        string_val: "nan"
        string_val: "nan"
        string_val: "nan"
        string_val: "nan"
        string_val: "nan"
        string_val: "nan"
        string_val: "The hydraulic temperature is below P(3,24) in P(3,26) sec."
        string_val: "nan"
        string_val: "Internal system error"
        string_val: "Internal system error\r\nThe system has experienced a floating point error, e.g... Division by zero. This error can happen due to a number of reasons, but it is often due to errors in parameters in pitch system. If the computer fails on this error on every startup, the only solution is to overwrite the parameters by starting with button 2. If the turbine can be in emergency without problems, but e.g. faults when generator is connected, check changed pitch parameters. NB! The ground processor sees this error as a \"no communication with top\", but the system error can be seen in the log."
        string_val: "Internal system error . The system has experienced a floating point error, e.g... division by zero. This error can happen due to a number of reasons, but it is often due to errors in parameters in pitch system. If the computer fails on this error on every startup, the only solution is to overwrite the parameters by starting with button 2. If the turbine can be in emergency without problems, but e.g. faults when generator is connected, check changed pitch parameters. NB! If the fault is in the Top processor, the ground processor sees this error as a \"no communication with top\", but the system error can be seen in the log."
        string_val: "The voltage drops under the early warning limit and rises again so the computer still works. This error supervision is not active, instead the message \"Power cut out\" is written to the operation log."
        string_val: "nan"
        string_val: "nan"
        string_val: "Internal system error"
        string_val: "The ground processor has reported a crash error from the memory address referred in the log line. The address is the 80x86 Segment, and Offset in signed decimal form."
        string_val: "The top processor has reported a crash error from the memory address referred in the log line. The address is the 80x86 Segment, and Offset in signed decimal form."
        string_val: "The grid processor has reported a crash error from the memory address referred in the log line. The address is the 80x86 Segment, and Offset in signed decimal form."
        string_val: "The number of auto restarts exceeds 10 (P14, 47). The counting are reset once a day (at midnight) and at manual control at the turbine (push on run, pause or acknowledge of error, also by the remote control)."
        string_val: "The emergency circuit not connected 3 sec. (P10, 1) after K901 is set active in the ground. This error is seen if one of the emergency buttons is not released before acknowledge, or run. Another reason might be an error in the emergency, VOG, or thermistor circuit."
        string_val: "The emergency stop has been pressed. This error will only occur, if the emergency stop circuit is opened and the controllers are not in the next 2000 ms (P14, 48) is able to detected other errors, which results in emergency. This delay concerns only the registration of the error, not the reaction. If this error occur without the emergency stop has been pressed the reason might be an error in the emergency, VOG, or thermistor circuit."
        string_val: "It is controlled that the phase sequence on the grid is correct. The monitoring can be disabled with (P6,1) parameter."
        string_val: "The CT3251 processor has not been able to measure the phase Sequence, perhaps because of a very instable grid frequency or voltage."
        string_val: "The CT3503 GND processor has not received a status telegram from the CT3251 processor, with information about phase sequence."
        string_val: "The Top processor has not been able to change the operation state within 3 sec (P14,52)."
        string_val: "The grid processor has not been able to change the operation state within 3 sec (P14, 52)."
        string_val: "Internal system error"
        string_val: "The response from the bypassing is active."
        string_val: "The feedback from the bypassing is not correct in 1000msec (P14, 12). This monitoring can be switched off (P14, 13-17)."
        string_val: "40 ms Scan The feedback from generator choice-contactors is not correct in 1000 msec (P14, 12). This monitoring can be switched off (P14, 13)."
        string_val: "Generator breaker is disconnected in the state RUN. This supervision prevents the turbine from being left with the breaker open after service visit."
        string_val: "The answer from the bypassing is not active."
        string_val: "The feedbacks from phase compensation are not correct in 1000 msec (P14, 12). This monitoring can be switched off (P14, 13-17). At change from stop to pause it is checked, that the contactors are disabled."
        string_val: "nan"
        string_val: "One of the signals are active at change from Emergency to Stop"
        string_val: "When the generator speed exceeds 900 o/oo (P4, 16) of nominal speed it is checked, that the anemometer shows at least (P4, 17) m/s. This error can be due to a defect, or an iced anemometer. If the turbine has a tower anemometer installed, then it is important that the error is corrected because the anemometer signal is part of a blade deflection reduction feature (PS3-operation)."
        string_val: "When the power exceeds 950 o/oo (P4, 21) of nominal power (P9, 52) it is checked, that the anemometer shows least 8.0 m/s (P4, 22). The power and wind speed is attenuated exponential with the time constant 30 sec. (P4, 20)."
        string_val: "Frequency has been over 40 o/oo (P1 ,110) in 2000 msec (P1,111), or the frequency has been under 80 o/oo (P1 ,109) in 2000 msec (P1 ,111). This supervision is in reality disabled by the parameters settings listed above. It can be activated if a fast disconnection of generator is needed."
        string_val: "Monitored if average of 1 period values of the current in the 3 phases is over (P1 ,67) A. Logged if the current in 1 phase is under 750 o/oo (P1 ,64) of the average in 1 sec. (P1,66). The log message contains the current in this phase, and the average of the 3 phases. This supervision detects a phase brake, fault in the generator, or a bad connection in the generator cables. This error is also seen if the grid is asymmetric due to many single-phase consumers on one phase."
        string_val: "Monitored if average of 1 period values of the current in the 3 phases is over (P1 ,67) A. Logged if the current in 1 phase is under 750 o/oo (P1 ,64) of the average in 1 sec. (P1,66). The log message contains the current in this phase, and the average of the 3 phases. This supervision detects a phase brake, fault in the generator, or a bad connection in the generator cables. This error is also seen if the grid is asymmetric due to many single-phase consumers on one phase."
        string_val: "Monitored if average of 1 period values of the current in the 3 phases is over (P1 ,67) A. Logged if the current in 1 phase is under 750 o/oo (P1 ,64) of the average in 1 sec. (P1,66). The log message contains the current in this phase, and the average of the 3 phases. This supervision detects a phase brake, fault in the generator, or a bad connection in the generator cables. This error is also seen if the grid is asymmetric due to many single-phase consumers on one phase."
        string_val: "The current is over 130 o/oo (P1, 54) and not under 130 o/oo (P1, 55) of nominal current (P1, 45-50) in P1, 20 sec.(P1, 56)."
        string_val: "The current in a phase has been over 375 o/oo (P1, 51) and not under 375 o/oo (P1,52) of nominal current (P1 ,46 or 49) in 1000 msec (P1 ,53)."
        string_val: "The current in a phase has been over 1000 o/oo (P1, 57) and not under 1000 o/oo (P1, 58) of nominal current (P1, 47 or 50) in 1000 msec (P1, 59)."
        string_val: "The voltage in a phase has been (P1, 6) o/oo over nominal Voltage (P1, 119) in (P1, 8) msec."
        string_val: "The voltage in a phase has been (P1, 9) o/oo over Nominal Voltage (P1, 119) in (P1, 11) msec."
        string_val: "The voltage in a phase has been 200 o/oo (P1, 18) over nominal Voltage (P1, 119) in 80 msec (P1, 20). The Q8 can trip by itself, due to a high current, or ground fault. The controller can trip Q8 due to-Over voltage, If a turbine has a tripped Q8, the grid voltage has to be checked before the breaker is closed, and controller is started. When the controller is started, it can be seen in the log if the controller has tripped the breaker. On a V47 the controller is started by pressing the service button. In order to start the controller the breaker Q16 has to be closed. If only one of the breakers has tripped, then the breaker has tripped by itself."
        string_val: "Frequency has been over (P1, 99) o/oo in 200 msec (P1, 103), or the frequency has been under (P1, 101) o/oo in 200 msec (P1, 103)."
        string_val: "88) of nominal power (P1, 115 ... 117)(Gen0 .. Gen1) in 2000 msec. (P1 ,90)."
        string_val: "The measured power has been below -500 o/oo (P1, 91) of nominal power (P1, 115 ... 117) in 1000 ms (P1, 93)."
        string_val: "There has been ground fault. The leak current attenuated exponential with a Time constant of 1000 ms. (P1,41).The leak current has been over 500 o/oo (P1 ,68) of nominal current (P1 ,45 .. 50) for 40 msec (P1 ,70). of measurement technical reasons the controller can report this error during thyristor test."
        string_val: "The turbine has been too slow disconnecting the generator, after change from RUN. The power is higher than 1000 o/oo (P1 ,94) of nominal power (P1 ,115 - 117). Monitored in pause and stop, but not in the first 15 seconds (P1, 96) + the time used to ramp the power down."
        string_val: "The voltage in a phase has been (P1, 12) over Nominal Voltage (P1, 119) in 60 seconds (P1, 14)."
        string_val: "The voltage in a phase has been (P1, 15) o/oo under nominal voltage (P1, 119) in 60 seconds (P1, 17)."
        string_val: "The current is not symmetric on the three phases. The asymmetrical current exponential attenuated with 100 (P1, 42) sec., has for more than 10 sec (P1, 75). been over o/oo (P1 ,71-74) of the average current in the tree phases exponential attenuated with 100 (P1 ,42) sec. The supervision is activated when the current is larger than 300 (P1, 77) o/oo off the nominal current (P1, 45 ... 50). The reason can be a fault in the turbine, or in the grid. Check if the PFC batteries are drawing the same current on all phases. If a fault in the generator is suspected, shift the tree phases without shifting the phase sequence, and check if the fault is following the grid or the generator. The reason is often many single phase consumers on one phase somewhere in the grid."
        string_val: "The current is not symmetric on the three phases. The asymmetrical current exponential attenuated with 100 (P1, 42) sec., has for more than 10 sec (P1, 75). been over o/oo (P1 ,71-74) of the average current in the tree phases exponential attenuated with 100 (P1 ,42) sec. The supervision is activated when the current is larger than 300 (P1, 77) o/oo off the nominal current (P1, 45 ... 50). The reason can be a fault in the turbine, or in the grid. Check if the PFC batteries are drawing the same current on all phases. If a fault in the generator is suspected, shift the tree phases without shifting the phase sequence, and check if the fault is following the grid or the generator. The reason is often many single phase consumers on one phase somewhere in the grid."
        string_val: "The current is not symmetric on the three phases. The asymmetrical current exponential attenuated with 100 (P1, 42) sec., has for more than 10 sec (P1, 75). been over o/oo (P1 ,71-74) of the average current in the tree phases exponential attenuated with 100 (P1 ,42) sec. The supervision is activated when the current is larger than 300 (P1, 77) o/oo off the nominal current (P1, 45 ... 50). The reason can be a fault in the turbine, or in the grid. Check if the PFC batteries are drawing the same current on all phases. If a fault in the generator is suspected, shift the tree phases without shifting the phase sequence, and check if the fault is following the grid or the generator. The reason is often many single phase consumers on one phase somewhere in the grid."
        string_val: "The current is not symmetric on the three phases. The asymmetrical current exponential attenuated with 100 (P1, 42) sec., has for more than 10 sec (P1, 75). been over o/oo (P1 ,71-74) of the average current in the tree phases exponential attenuated with 100 (P1 ,42) sec. The supervision is activated when the current is larger than 300 (P1, 77) o/oo off the nominal current (P1, 45 ... 50). The reason can be a fault in the turbine, or in the grid. Check if the PFC batteries are drawing the same current on all phases. If a fault in the generator is suspected, shift the tree phases without shifting the phase sequence, and check if the fault is following the grid or the generator. The reason is often many single phase consumers on one phase somewhere in the grid."
        string_val: "The current is not symmetric on the three phases. The asymmetrical current exponential attenuated with 100 (P1, 42) sec., has for more than 10 sec (P1, 75). been over o/oo (P1 ,71-74) of the average current in the tree phases exponential attenuated with 100 (P1 ,42) sec. The supervision is activated when the current is larger than 300 (P1, 77) o/oo off the nominal current (P1, 45 ... 50). The reason can be a fault in the turbine, or in the grid. Check if the PFC batteries are drawing the same current on all phases. If a fault in the generator is suspected, shift the tree phases without shifting the phase sequence, and check if the fault is following the grid or the generator. The reason is often many single phase consumers on one phase somewhere in the grid."
        string_val: "The current is not symmetric on the three phases. The asymmetrical current exponential attenuated with 100 (P1, 42) sec., has for more than 10 sec (P1, 75). been over o/oo (P1 ,71-74) of the average current in the tree phases exponential attenuated with 100 (P1 ,42) sec. The supervision is activated when the current is larger than 300 (P1, 77) o/oo off the nominal current (P1, 45 ... 50). The reason can be a fault in the turbine, or in the grid. Check if the PFC batteries are drawing the same current on all phases. If a fault in the generator is suspected, shift the tree phases without shifting the phase sequence, and check if the fault is following the grid or the generator. The reason is often many single phase consumers on one phase somewhere in the grid."
        string_val: "The current in a phase has been 130 o/oo (P1 ,54) over nominal current (P1,46 or 49) for the connected generator without/with capacitors connected for 20 sec. (P1,56).For this supervision an exponential 60 sec (P1 ,43) mean is used."
        string_val: "The current in a phase has been 140 o/oo (P1 ,60) over nominal current (P1 ,47 or 50) for the connected generator without/with capacitors connected for 20 sec. (P1,62).For this supervision an exponential 60 sec (P1 ,43) mean is used."
        string_val: "Wind speed is over (P4,8) m/s while the turbine is operating or over (P4,9) m/s when it tries to start operating. Wind speed is attenuated exponential the time constant T = 100 sec (P4,5)."
        string_val: "The ambient temperature is lower than (P4, 11) \302\260C in 60 sec. (P4, 15)."
        string_val: "The temperature in the gear has been higher than (P5, 18) in 20 sec (P5, 20). Check if oil is flowing though the oil cooler when the pump is active."
        string_val: "The temperature of the generator is higher than (P5, 21 or 24) \302\260C in 20 sec. (P5, 23 or 26)."
        string_val: "nan"
        string_val: "The temperature in the bearing is higher than P5, 27 or P5, 30 in 20 sec. (P5, 29) (P5, 32)."
        string_val: "nan"
        string_val: "At change from emergency to stop the Rotor RPM has to be below 500 o/oo (P5, 34) of Nominal GenRPM (P5, 2)/ Gear ratio (P5, 4)."
        string_val: "The generator RPM is found higher than P5,8 o/oo of nominal Generator RPM (P5,2) in 200 msec. (P5,9)"
        string_val: "The rotor RPM is higher than (P5, 13) o/oo of NominalGenRPM / GearRatio (P5,4) in 200 msec. (P5,14). The reason can be a gust more powerful than the control system can handle, or a problem in the rotor RPM proximity sensor. Check the distance between the sensor and the rotor locking disc. If the problem still exists replace the proximity sensor with item no. 114257, type with pull down resistor."
        string_val: "The slip has been higher than o/oo (P5, 5) or (P5, 6) of Nominal GenRPM in (P5, 7) msec.. The slip is the difference between generator speed and Nominal GenRPM. The generator RPM averaged with the time constant (P5, 35) sec. This error is seen if the generator has been rotating too fast in a period of 5-30 sec. due to gusts, where the control system failed to keep the speed within the limits."
        string_val: "S403 is disabled from mechanical chock sensor."
        string_val: "The generator RPM is higher than 500 o/oo (P5, 10) of Nominal GenRPM. Monitored in pause and stop, but not in the first (P5, 12) sec. plus the time regulating down after change from RUN."
        string_val: "The rotor and generator speed does not match the gear ratio. The difference of the rotor RPM and the generator RPM divided with gear-ratio (P5,4) is higher than \014150 o/oo (P5, 15) in 2 sec. (P5,16). The Generator RPM has to be more than 500 o/oo (P5, 17) of nominal Generator RPM, or the Rotor RPM has to be more than 500 o/oo (P5, 17) of nominal Rotor RPM, before supervision is activated."
        string_val: "The rotor speed has been too high, VOG has tripped, and disabled S405. This error is typical seen when a powerful gust has brought the turbine in an over speed situation. There can also be an error in the measurement, check the adjustment of the proximity rotor sensor for the VOG, or replace the sensor with item no. 114257 with pull down resistors if the problem is persistent The VOG is reset by interrupting it\'s 24 V supply. On turbines with battery backup of the VOG, the battery supply has to be disconnected, or VOG removed from it\'s socket."
        string_val: "Thermistor in brake pad is too hot, and have disabled S207, and opened the emergency circuit."
        string_val: "The pressure limit are not reached after 60 seconds (P3,2) pumping.."
        string_val: "S202 is disable and the state is run."
        string_val: "The hydraulic working pressure has been too low. The pressure has been less than P3,8 for more than 200 msec. (P3,1 0). The reason can be a fault in the hydraulic system, or the turbine has pitched excessive due to turbulent wind or unsuitability in control system."
        string_val: "The pressure drop across the filter has disconnected pressure switch S201. S204 (Hydraulic Pump) on in 2 sec. (P3, 11), S201 disabled, and if the hydraulics oil temperature is above (P3, 12) \302\260C. The pressure drop across the filter increases if the oil is thick (cold) or the filter is nearly blocked."
        string_val: "The oil level in the hydraulic tank has been low, and the level switch has deactivated S200 in 2 seconds (P3, 13)."
        string_val: "The hydraulic motor has been overloaded, and the thermo relay has disabled F205."
        string_val: "The temperature is higher than 65 \302\260C (P3, 21) in 20 sec. (P3, 23)."
        string_val: "nan"
        string_val: "A thermo relay has detected an overloaded nacelle fan motor, and the motor has been stopped."
        string_val: "A thermo relay has tripped due to an overload in a gear oil pump, and the motor has been stopped"
        string_val: "nan"
        string_val: "Feedback from nacelle ventilator contactor is not correct within 1000 ms (P14, 12). The monitoring can be switched off (P14,13-17)."
        string_val: "Feedback is not correct within 1000 ms (P14,12). The monitoring can be switched off (P14, 13-17)."
        string_val: "Feedback is not correct in 1000 msec (P14, 12). The monitoring can be switched off (P13, 14-17)."
        string_val: "The temperature in bus bar section of the controller is too high, and the thermistor has disabled S311."
        string_val: "The temperature in one of the thyristors is to high, and the thermistor has disabled S702."
        string_val: "The temperature in the ground controller is too low (below 0\302\260C), and the panel thermostat has disabled S305. 60 Sec. after the signal has been disabled, the supply to all computers is disconnected by a timer. I.e this courses the turbine to PAUSE within 0-10 sec. and Emergency after 60 sec. When the temperature is above 0\302\260C, the computer is started again. The reason can be-Misajustment of thermostat, -error in heating element or PTS5, -or the ambient temperature is below (-20\302\260C.)"
        string_val: "One of the tree surge arrestors is damaged, and Signal S9 is disabled"
        string_val: "The combination of signals from the yaw control indicates an error in the signals, or the turbine is over yawing the cables. All 3 signals are deactivated or S102 and S103 are active at the same time."
        string_val: "S105 has not changed level after continuous yawing in the same direction in 900 sec. (P2, 7). This indicates an error in the yaw control, or yaw motors."
        string_val: "Feedback is not correct in 1000 msec (P14, 12). The monitoring can be switched off (P14, 13-17)."
        string_val: "Feedback is not correct in 1000 msec (P14, 12). The monitoring can be switched off (P14, 13-17)."
        string_val: "Automatic yawing done continuously in the same direction for more than 1000 seconds (P2, 11). This error indicates a broken or iced wind vane."
        string_val: "Untwisting done for more than 3600 seconds (P2, 9). This indicates an error in yaw motors or yaw control."
        string_val: "S102 is active during untwisting CW or S103 is active during untwisting CCW"
        string_val: "One of the yaw motors has been overloaded, and its thermo relay has disconnected the signal."
        string_val: "No power supply for hydraulic feathering valves."
        string_val: "No power supply for proportional valve."
        string_val: "Feedback is not correct within 1000 ms (P14,12). The monitoring can be switched off (P14, 13-17)."
        string_val: "The difference between pitch and actual has in10 (P9, 123) sec. been higher than (P9, 122)\302\260."
        string_val: "The difference between expected pitch velocity and actual pitch Velocity has (P9, 133) times been higher than (P9, 134) \302\260/s. The pitch velocity is a function of the control voltage (proportional valve characteristic)."
        string_val: "If the standard deviation on the control voltage is higher than 9000 mV (P9, 141) the last 10000 ms (P9, 142)."
        string_val: "If the mean power i higher than (P9, 144) and the standard deviation on the power is higher than (P9, 143) over the last P9, 145 ms."
        string_val: "Actual pitch (the measured) is less than 80.0\302\260 (P9, 122) in STOP."
        string_val: "The actual generator power does not correspond to the requested power at this generator speed. If the difference between the actual power and the internal power reference has been higher than (P9, 179) kW, the difference is attenuated exponential with a time constant of 60 msec (P9, 178). If the power is positive (E.g. Power Error 75 kW) then the actual power is higher than the reference, and the reason is fluctuations in power."
        string_val: "nan"
        string_val: "nan"
        string_val: "nan"
        string_val: "nan"
        string_val: "nan"
        string_val: "nan"
        string_val: "nan"
        string_val: "nan"
        string_val: "nan"
        string_val: "nan"
        string_val: "nan"
        string_val: "nan"
        string_val: "nan"
        string_val: "nan"
        string_val: "The temperature in the gear oil has been under -5 \302\260C (P4,81), and not above -2 \302\260C (P4.82) again in 20 Sec. (P5.83)."
        string_val: "nan"
        string_val: "Is reported if the temperature sensor shows values higher than 200\302\260C (P4,25) or lower than - 45\302\260C (P4,26) in 2 sec. (P4,27)."
        string_val: "nan"
        string_val: "nan"
        string_val: "nan"
        string_val: "nan"
        string_val: "nan"
        string_val: "nan"
        string_val: "nan"
        string_val: "The controller has been restarted by the watchdog, and the controller has no indication of why the system has stopped trigging the watchdog."
        string_val: "nan"
        string_val: "nan"
        string_val: "nan"
        string_val: "nan"
        string_val: "nan"
        string_val: "nan"
        string_val: "nan"
        string_val: "nan"
        string_val: "If one of the contactors has feedback 1, which indicates a welded contactor, the Q8 is tripped in order to stop the motor controlled by this contactor. If the turbine after reaction to a feedback error still has a feedback 1, the Q8 is tripped after (P14, 18) s. If the faulted contactor is K700/K705 then the delay is only one sec. This is not supervised in service mode. The name of offending contactor can be seen in the previous log message. The Q8 can trip by itself, due to a high current, or ground fault. The controller can trip Q8 due to.If a turbine has a tripped Q8, the grid voltage has to be checked before the breakers are closed, and controller is started. \014When the controller is started, it can be seen in the log if the controller has tripped the breaker. The controller is started by pressing the service button. In order to start the controller the breaker Q16 has to be closed. If only one of the breakers has tripped, then the breaker has tripped by itself."
        string_val: "nan"
        string_val: "Logged if the ambient temperature is higher than 45\302\260C (P4.13)"
        string_val: "The error occurs if the turbine still has high current after disconnecting the generator. The Q8 can trip by itself, due to a high current, or ground fault. The controller can trip Q8 due toIf a turbine has a tripped Q8, the grid voltage has to be checked before the breaker is closed, and controller is started. When the controller is started, it can be seen in the log if the controller has tripped the breaker. On a PS-600 kW WEG the controller is started by pressing the service button. In order to start the controller the breaker Q16 has to be closed. If only one of the breakers has tripped, then the breaker has tripped by itself."
        string_val: "The error occurs if the under voltage is higher than 250o/oo (P1, 34) of nominal voltage (P1, 119) in 80 ms (P1, 36)"
        string_val: "nan"
        string_val: "nan"
        string_val: "The difference between the measured power and the measured wind is too high. The wind is corrected for mass, and converted to power by a power curve described by (P9.157) and (P9.158). The measured and calculated power is averaged in a first order filter with a tau of (P9.159) s. If the measured power is (9.160) o/oo above the calculated power (power curve) the error is reported. If the measured power is (9.161) o/oo below the calculated power (power curve) the error is reported"
        string_val: "nan"
        string_val: "nan"
        string_val: "Pitch position sensor supervision (Balluf). If the measured voltage is not inside the adjusted limits, incl. tolerances, of the Balluf end stop an error message is given. Furthermore an error is messaged if the positioning sensor has detected a pitch speed that is not mechanical possible. Error adjustment of Balluf is not correct. Electrical noise. Problems with the signal transmission line between VMP control system and pitch position sensor."
        string_val: "nan"
        string_val: "nan"
        string_val: "The wind speed measured by nacelle anemometer does not match the power delivered by the turbine."
        string_val: "The wind speed measured by tower anemometer does not match the power delivered by the"
        string_val: "Thermistor in oil conditioning system has been activated"
        string_val: "The oil conditioning system cannot maintain the necessary pressure."
        string_val: "The turbine has RUN with no oil conditioning for too long time."
        string_val: "nan"
        string_val: "The ultrasonic wind sensor sends invalid measurement results"
        string_val: "It is not possible that the wind speed has changed as fast as measured."
        string_val: "An unrealistic change in wind speed has been measured. The wind vane cannot move as fast as measured."
        string_val: "nan"
        string_val: "nan"
        string_val: "nan"
        string_val: "nan"
        string_val: "nan"
        string_val: "nan"
        string_val: "nan"
        string_val: "nan"
        string_val: "nan"
        string_val: "nan"
        string_val: "nan"
        string_val: "nan"
        string_val: "nan"
        string_val: "nan"
        string_val: "nan"
        string_val: "nan"
        string_val: "When the generator speed exceeds 1000 o/oo (P4, 18) of synchronous speed it is checked that the anemometer shows at least (P4, 19) m/s. This error can be due to a defect or an iced up anemometer. It is important that the error is corrected because the anemometer signal is part of a blade deflection reduction feature (PS3-operation). Note! It has been observed that this error can occur without the anemometer being defect. Then the error occurs in low wind when the wind is in a direction which leaves the anemometer in the tower wake. In this case the error can be ignored."
        string_val: "The vertical (negative) wind shear exceeds the permissible limit (par. 9.259 \"E-1 m/s Min. Wind shear limit\"). The wind shear limit depends on the PS3 parameter set used in the turbine (PS3.A or PS3.B, see the individual parameter configuration document for the software release in question). If a PS3.A turbine experiences \"too many\" of this wind shear error then upgrade the turbine to a PS3.B turbine. If a PS3.B turbine experiences these errors no action is to be taken."
        string_val: "This supervision is only active when the oil temperature is above 40 deg.C (S425MinTempLimitPx)."
        string_val: "Communication problem longer than 60 sec. (P2,89) with US wind sensor(s)."
        string_val: "The oscillation level in the transmission system exceeds the alarm level. Specification of demands 989022\r\nError correction instruction:1) Retrieve the vdf-buffer from the turbine. Check that the VMP parameters in group 9 and 11 are according to the service bulletin. 2) If The parameters are correct check the condition of the gear torque arms, e.g. what is the clearance between the disc springs? Send a short description of the condition of the gear torque arms along with the vdf-buffer and ram-dump to your technical support department further analysis. If the dominating oscillation frequency in the generator speed (above 0.5 Hz) is the 3P frequency (f3p=3*rotor rpm/60 [Hz]) the error is caused by extreme wind conditions and not defect gear torque arms or wrong parameters. If the dominating oscillation is between 2 and 3 Hz the gear torque arms probably are defect."
      }
    }
  }
}
node {
  name: "value_var"
  op: "VariableV2"
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_STRING
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 263
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "value_var/Assign"
  op: "Assign"
  input: "value_var"
  input: "Const_1"
  attr {
    key: "T"
    value {
      type: DT_STRING
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@value_var"
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "value_var/read"
  op: "Identity"
  input: "value_var"
  attr {
    key: "T"
    value {
      type: DT_STRING
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@value_var"
      }
    }
  }
}
node {
  name: "save/Const"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_STRING
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_STRING
        tensor_shape {
        }
        string_val: "model"
      }
    }
  }
}
node {
  name: "save/SaveV2/tensor_names"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_STRING
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_STRING
        tensor_shape {
          dim {
            size: 2
          }
        }
        string_val: "keys_var"
        string_val: "value_var"
      }
    }
  }
}
node {
  name: "save/SaveV2/shape_and_slices"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_STRING
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_STRING
        tensor_shape {
          dim {
            size: 2
          }
        }
        string_val: ""
        string_val: ""
      }
    }
  }
}
node {
  name: "save/SaveV2"
  op: "SaveV2"
  input: "save/Const"
  input: "save/SaveV2/tensor_names"
  input: "save/SaveV2/shape_and_slices"
  input: "keys_var"
  input: "value_var"
  attr {
    key: "dtypes"
    value {
      list {
        type: DT_STRING
        type: DT_STRING
      }
    }
  }
}
node {
  name: "save/control_dependency"
  op: "Identity"
  input: "save/Const"
  input: "^save/SaveV2"
  attr {
    key: "T"
    value {
      type: DT_STRING
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@save/Const"
      }
    }
  }
}
node {
